src/cf/maERP_ib/src/InformationRegisters/ОтработанноеВремяСотрудников/ОтработанноеВремяСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтработанноеВремяСотрудников</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>План</name>
    <type>
      <types>DefinedType.ОтработанноеВремя</types>
    </type>
  </resources>
  <resources>
    <name>Факт</name>
    <type>
      <types>DefinedType.ОтработанноеВремя</types>
    </type>
  </resources>
  <attributes>
    <name>Вариант</name>
    <type>
      <types>CatalogRef.ВариантыВыходаНаРаботу</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/maERP_ib/src/InformationRegisters/ОтработанноеВремяСотрудников/ManagerModule.bsl
Функция ПолучитьЗаМесяц(ДатаСреза, Сотрудник) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОтработанноеВремяСотрудников.ДатаВыхода КАК ДатаВыхода,
	                      |	ОтработанноеВремяСотрудников.План КАК План,
	                      |	ОтработанноеВремяСотрудников.Факт КАК Факт,
	                      |	ОтработанноеВремяСотрудников.Вариант В (ЗНАЧЕНИЕ(Справочник.ВариантыВыходаНаРаботу.Рабочий), ЗНАЧЕНИЕ(Справочник.ВариантыВыходаНаРаботу.Больничный)) КАК ПоГрафику,
	                      |	ВЫБОР
	                      |		КОГДА ОтработанноеВремяСотрудников.Вариант = ЗНАЧЕНИЕ(Справочник.ВариантыВыходаНаРаботу.ПустаяСсылка)
	                      |			ТОГДА 1
	                      |		КОГДА ОтработанноеВремяСотрудников.Вариант.Коэффициент = 0
	                      |			ТОГДА 1
	                      |		ИНАЧЕ ОтработанноеВремяСотрудников.Вариант.Коэффициент
	                      |	КОНЕЦ КАК Коэффициент
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	РегистрСведений.ОтработанноеВремяСотрудников КАК ОтработанноеВремяСотрудников
	                      |ГДЕ
	                      |	ОтработанноеВремяСотрудников.Сотрудник = &Сотрудник
	                      |	И ОтработанноеВремяСотрудников.ДатаВыхода МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаСреза, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ДатаСреза, МЕСЯЦ)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ.ДатаВыхода КАК ДатаВыхода,
	                      |	ВТ.План КАК План,
	                      |	ВТ.Факт КАК Факт,
	                      |	ВТ.ПоГрафику КАК ПоГрафику,
	                      |	ВТ.Коэффициент КАК Коэффициент
	                      |ИЗ
	                      |	ВТ КАК ВТ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатаВыхода
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СУММА(ВТ.План * ВТ.Коэффициент) КАК ЧасовПлан,
	                      |	СУММА(ВТ.Факт * ВТ.Коэффициент) КАК ЧасовФакт,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА ВТ.ПоГрафику
	                      |				ТОГДА ВТ.План * ВТ.Коэффициент
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК ЧасовПланПоГрафику,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА ВТ.ПоГрафику
	                      |				ТОГДА ВТ.Факт * ВТ.Коэффициент
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК ЧасовФактПоГрафику,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА ВТ.План > 0
	                      |				ТОГДА 1
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК ВыходовПлан,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА ВТ.Факт > 0
	                      |				ТОГДА 1
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК ВыходовФакт,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА ВТ.План > 0
	                      |					И ВТ.ПоГрафику
	                      |				ТОГДА 1
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК ВыходовПланПоГрафику,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА ВТ.Факт > 0
	                      |					И ВТ.ПоГрафику
	                      |				ТОГДА 1
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК ВыходовФактПоГрафику
	                      |ИЗ
	                      |	ВТ КАК ВТ");
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Рез = Запрос.ВыполнитьПакет();
	Результат = Новый Структура;
	Результат.Вставить("ТЗДанные", Рез[1].Выгрузить());
	ТЗИтог = Рез[2].Выгрузить();
	Результат.Вставить("ЧасовПлан", ТЗИтог.Итог("ЧасовПлан"));
	Результат.Вставить("ЧасовФакт", ТЗИтог.Итог("ЧасовФакт"));
	Результат.Вставить("ЧасовПланПоГрафику", ТЗИтог.Итог("ЧасовПланПоГрафику"));
	Результат.Вставить("ЧасовФактПоГрафику", ТЗИтог.Итог("ЧасовФактПоГрафику"));
	Результат.Вставить("ВыходовПлан", ТЗИтог.Итог("ВыходовПлан"));
	Результат.Вставить("ВыходовФакт", ТЗИтог.Итог("ВыходовФакт"));
	Результат.Вставить("ВыходовПланПоГрафику", ТЗИтог.Итог("ВыходовПланПоГрафику"));
	Результат.Вставить("ВыходовФактПоГрафику", ТЗИтог.Итог("ВыходовФактПоГрафику"));
	// Представление
	Результат.Вставить("ВыходовПланПредставление", Строка(Результат.ВыходовПлан) 
		+ " " + ОбщегоНазначенияКлиентСервер.СформироватьПредметИсчисления(Результат.ВыходовПлан, "Выход", "Выхода", "Выходов") 
		+ " (" + Результат.ЧасовПлан + " " + ОбщегоНазначенияКлиентСервер.СформироватьПредметИсчисления(Результат.ЧасовПлан, "час", "часа", "часов") + ")");
	Результат.Вставить("ВыходовФактПредставление", Строка(Результат.ВыходовФакт) 
		+ " " + ОбщегоНазначенияКлиентСервер.СформироватьПредметИсчисления(Результат.ВыходовФакт, "Выход", "Выхода", "Выходов") 
		+ " (" + Результат.ЧасовФакт + " " + ОбщегоНазначенияКлиентСервер.СформироватьПредметИсчисления(Результат.ЧасовФакт, "час", "часа", "часов") + ")");
	Результат.Вставить("ВыходовПланПоГрафикуПредставление", Строка(Результат.ВыходовПланПоГрафику) 
		+ " " + ОбщегоНазначенияКлиентСервер.СформироватьПредметИсчисления(Результат.ВыходовПланПоГрафику, "Выход", "Выхода", "Выходов") 
		+ " (" + Результат.ЧасовПланПоГрафику + " " + ОбщегоНазначенияКлиентСервер.СформироватьПредметИсчисления(Результат.ЧасовПланПоГрафику, "час", "часа", "часов") + ")");	
	Результат.Вставить("ВыходовФактПоГрафикуПредставление", Строка(Результат.ВыходовФактПоГрафику) 
		+ " " + ОбщегоНазначенияКлиентСервер.СформироватьПредметИсчисления(Результат.ВыходовФактПоГрафику, "Выход", "Выхода", "Выходов") 
		+ " (" + Результат.ЧасовФактПоГрафику + " " + ОбщегоНазначенияКлиентСервер.СформироватьПредметИсчисления(Результат.ЧасовФактПоГрафику, "час", "часа", "часов") + ")");
	Возврат Результат;	
КонецФункции
